# running in uart_prove/src/
read -formal openPolarisUART.sv
read -formal tlul_slave_formal.sv
read -sv uart_rx.sv
read -sv uart_tx.sv
read -sv sfifo.sv
read -sv skdbf.sv
read -sv polaris_uart_ip.sv
prep -top openPolarisUART
hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
